INSERT INTO
    "resource" (id, name, cost_by_one, one_is_called)
VALUES
    (0, "Бумага А5", 5.0, "Лист"),
    (1, "Бумага А4", 7.0, "Лист"),
    (2, "Бумага А3", 10.0, "Лист"),
    (3, "Чернила струйные", 8.0, "Миллилитр"),
    (4, "Чернила пигментные", 10.0, "Миллилитр"),
    (5, "Тонер лазерный", 15.0, "Миллилитр");

INSERT INTO
    "item" (id, name, cost_by_one, one_is_called)
VALUES
    (0, "Фотография А5 (пигмент)", 20.0, "Штука"),
    (1, "Фотография А4 (пигмент)", 25.0, "Штука"),
    (2, "Фотография А5 (струйник)", 18.0, "Штука"),
    (3, "Фотография А4 (струйник)", 22.5, "Штука"),
    (4, "Фотография А4 (лазер)", 30.0, "Штука"),
    (5, "Фотография А3 (лазер)", 40.0, "Штука"),
    (6, "Документ А4", 15.0, "Штука"),
    (7, "Документ А3", 12.0, "Штука"),
    (8, "Документ А5", 10.0, "Штука"),
    (9, "Ламинирование", 20.0, "Лист"),
    (10, "Переплет", 7.0, "Страница");

INSERT INTO
    "item_resource_need" (id, item_id, resource_id, quantity_needed)
VALUES
    (0, 0, 0, 1),
    (1, 0, 4, 0.2),
    (2, 1, 1, 1),
    (3, 1, 4, 0.3),
    (4, 2, 0, 1),
    (5, 2, 3, 0.2),
    (6, 3, 1, 1),
    (7, 3, 3, 0.3),
    (8, 4, 1, 1),
    (9, 4, 5, 0.3),
    (10, 5, 2, 1),
    (11, 5, 5, 0.4),
    (12, 6, 1, 1),
    (13, 6, 5, 0.3),
    (14, 7, 2, 1),
    (15, 7, 5, 0.4),
    (16, 8, 0, 1),
    (17, 8, 5, 0.2)
